In [1]:
import pandas as pd

In [2]:
table_one=pd.read_csv("table1.csv",sep="\t")

In [3]:
table_one

     A  B
0  NaN  3
1  0.0  4
2  NaN  5

In [4]:
table_two=pd.read_csv("table2.csv",sep="\t")

In [5]:
table_two

   A    B
0  1  3.0
1  0  NaN
2  3  3.0

In [6]:
# table 1 filled with values from table_2
table_one = table_one.combine_first(table_two)
table_one

     A    B
0  1.0  3.0
1  0.0  4.0
2  3.0  5.0

In [7]:
# table 2 filled with values from table 1
table_two = table_two.combine_first(table_one)
table_two

     A    B
0  1.0  3.0
1  0.0  4.0
2  3.0  3.0